<?php

namespace MVC\app\models;

// Модель для работы с фото
class Photo_model{
    // Константы для хранения данных о фото
    public static $photos = [['file' => 'Веб_Картинки/Россия.jpg', 'alt' => 'Россия'],
    ['file' => 'Веб_Картинки/Абхазия.jpg', 'alt' => 'Абхазия'],
    ['file' => 'Веб_Картинки/Австралия.jpg', 'alt' => 'Австралия'],
    ['file' => 'Веб_Картинки/Австрия.jpg', 'alt' => 'Австрия'],
    ['file' => 'Веб_Картинки/Азербайджан.jpg', 'alt' => 'Азербайджан'],
    ['file' => 'Веб_Картинки/Албания.jpg', 'alt' => 'Албания'],
    ['file' => 'Веб_Картинки/Алжир.jpg', 'alt' => 'Алжир'],
    ['file' => 'Веб_Картинки/Англия.jpg', 'alt' => 'Англия'],
    ['file' => 'Веб_Картинки/Ангола.jpg', 'alt' => 'Ангола'],
    ['file' => 'Веб_Картинки/Андорра.jpg', 'alt' => 'Андорра'],
    ['file' => 'Веб_Картинки/Бельгия.jpg', 'alt' => 'Бельгия'],
    ['file' => 'Веб_Картинки/Бенин.jpg', 'alt' => 'Бенин'],
    ['file' => 'Веб_Картинки/Болгария.jpg', 'alt' => 'Болгария'],
    ['file' => 'Веб_Картинки/Боливия.jpg', 'alt' => 'Боливия'],
    ['file' => 'Веб_Картинки/Босния.jpg', 'alt' => 'Босния']];

    public function getAllPhotos() {
        return self::$photos;
    }
}